from typing import Iterable, List

from spacy import util
from spacy.language import Language
from spacy.lang.ja import resolve_pos
from spacy.tokens import Doc, MorphAnalysis, Span, Token


__all__ = [
    "LuwXposTagger",
]


class LuwXposTagger:
    def __init__(self, vocab):
        self.vocab = vocab

    def __call__(self, doc: Doc):
        for t in doc:
            inf = t.morph.get("Inflection")
            if inf:
                inf_str = inf[0].split(";")[0]
                t.tag_ =  f"{t.tag_}-{inf_str}"
            upos_cond = SUW_XPOS_TO_LUW_XPOS.get(t.tag_)
            if upos_cond:
                if isinstance(upos_cond, str):
                    t.tag_ = upos_cond
                    continue
                lemma_cond = upos_cond.get(t.pos_)
                if lemma_cond:
                    if isinstance(lemma_cond, str):
                        t.tag_ = lemma_cond
                        continue
                    luw_xpos = lemma_cond.get(t.lemma_)  # omit last_suw
                    if luw_xpos:
                        t.tag_ = luw_xpos
                        continue
                    luw_xpos = LUW_UPOS_TO_LUW_XPOS.get(t.pos_)
                    if luw_xpos:
                        t.tag_ = luw_xpos
                        continue
            luw_xpos = LUW_UPOS_TO_LUW_XPOS.get(t.pos_)
            if luw_xpos:
                t.tag_ = luw_xpos
        return doc

    def to_bytes(self, **_kwargs):
        serializers = {}
        return util.to_bytes(serializers, [])

    def from_bytes(self, data, **_kwargs):
        return self

    def to_disk(self, path, **_kwargs):
        path = util.ensure_path(path)
        serializers = {}
        return util.to_disk(path, serializers, [])

    def from_disk(self, path, **_kwargs):
        pass


LUW_UPOS_TO_LUW_XPOS = {
    "ADJ": "形状詞-一般",
    "ADV": "副詞",
    "CCONJ": "接続詞",
    "DET": "連体詞",
    "INTJ": "感動詞-一般",
    "NOUN": "名詞-普通名詞-一般",
    "NUM": "名詞-数詞",
    "PRON": "代名詞",
    "SYM": "補助記号-一般",
}

SUW_XPOS_TO_LUW_XPOS = {
    # SUW==LUW

    #"代名詞": {"PRON": "代名詞"},
    #"副詞": {"ADV": "副詞"},
    #"助動詞-下一段-カ行": {"AUX": "助動詞-下一段-カ行"},
    #"助動詞-下一段-ガ行": {"AUX": "助動詞-下一段-ガ行"},
    #"助動詞-下一段-サ行": {"AUX": "助動詞-下一段-サ行"},
    #"助動詞-下一段-タ行": {"AUX": "助動詞-下一段-タ行"},
    #"助動詞-下一段-ダ行": {"AUX": "助動詞-下一段-ダ行"},
    #"助動詞-下一段-マ行": {"AUX": "助動詞-下一段-マ行"},
    #"助動詞-五段-カ行": {"AUX": "助動詞-五段-カ行"},
    #"助動詞-五段-サ行": {"AUX": "助動詞-五段-サ行"},
    #"助動詞-五段-ラ行": {"AUX": "助動詞-五段-ラ行"},
    #"助動詞-五段-ワア行": {"AUX": "助動詞-五段-ワア行"},
    #"助動詞-助動詞-ジャ": {"AUX": "助動詞-助動詞-ジャ"},
    #"助動詞-助動詞-タ": {"AUX": "助動詞-助動詞-タ"},
    "助動詞-助動詞-ダ": {"ADP": "助詞-格助詞"},
    #"助動詞-助動詞-タイ": {"AUX": "助動詞-助動詞-タイ"},
    #"助動詞-助動詞-デス": {"AUX": "助動詞-助動詞-デス"},
    #"助動詞-助動詞-ナイ": {"AUX": "助動詞-助動詞-ナイ"},
    #"助動詞-助動詞-ナンダ": {"AUX": "助動詞-助動詞-ナンダ"},
    #"助動詞-助動詞-ヌ": {"AUX": "助動詞-助動詞-ヌ"},
    #"助動詞-助動詞-ヘン": {"AUX": "助動詞-助動詞-ヘン"},
    #"助動詞-助動詞-マイ": {"AUX": "助動詞-助動詞-マイ"},
    #"助動詞-助動詞-マス": {"AUX": "助動詞-助動詞-マス"},
    #"助動詞-助動詞-ヤ": {"AUX": "助動詞-助動詞-ヤ"},
    #"助動詞-助動詞-ヤス": {"AUX": "助動詞-助動詞-ヤス"},
    #"助動詞-助動詞-ラシイ": {"AUX": "助動詞-助動詞-ラシイ"},
    #"助動詞-助動詞-レル": {"AUX": "助動詞-助動詞-レル"},
    #"助動詞-文語下二段-サ行": {"AUX": "助動詞-文語下二段-サ行"},
    #"助動詞-文語下二段-マ行": {"AUX": "助動詞-文語下二段-マ行"},
    #"助動詞-文語下二段-ラ行": {"AUX": "助動詞-文語下二段-ラ行"},
    #"助動詞-文語助動詞-キ": {"AUX": "助動詞-文語助動詞-キ"},
    #"助動詞-文語助動詞-ケリ": {"AUX": "助動詞-文語助動詞-ケリ"},
    #"助動詞-文語助動詞-ゴトシ": {"AUX": "助動詞-文語助動詞-ゴトシ"},
    #"助動詞-文語助動詞-ジ": {"AUX": "助動詞-文語助動詞-ジ"},
    #"助動詞-文語助動詞-ズ": {"AUX": "助動詞-文語助動詞-ズ"},
    #"助動詞-文語助動詞-タリ-完了": {"AUX": "助動詞-文語助動詞-タリ-完了"},
    #"助動詞-文語助動詞-タリ-断定": {"AUX": "助動詞-文語助動詞-タリ-断定"},
    #"助動詞-文語助動詞-ナリ-断定": {"AUX": "助動詞-文語助動詞-ナリ-断定"},
    #"助動詞-文語助動詞-ヌ": {"AUX": "助動詞-文語助動詞-ヌ"},
    #"助動詞-文語助動詞-ベシ": {"AUX": "助動詞-文語助動詞-ベシ"},
    #"助動詞-文語助動詞-マジ": {"AUX": "助動詞-文語助動詞-マジ"},
    #"助動詞-文語助動詞-ム": {"AUX": "助動詞-文語助動詞-ム"},
    #"助動詞-文語助動詞-ラシ": {"AUX": "助動詞-文語助動詞-ラシ"},
    #"助動詞-文語助動詞-リ": {"AUX": "助動詞-文語助動詞-リ"},
    #"助動詞-文語形容詞-ク": {"AUX": "助動詞-文語形容詞-ク"},
    #"助動詞-無変化型": {"AUX": "助動詞-無変化型"},
    #"助詞-係助詞": {"ADP": "助詞-係助詞"},
    "助詞-副助詞": {"AUX": {"や": "助動詞-助動詞-ヤ", None: "助動詞-五段-ワア行"}},
    "助詞-接続助詞": {"ADP": "助詞-格助詞", "SCONJ": {"て": "助動詞-下一段-タ行", "で": "助動詞-下一段-ダ行"}},
    "助詞-格助詞": {"AUX": "助動詞-助動詞-ダ", "SCONJ": "助詞-接続助詞"},
    "助詞-準体助詞": {"ADP": "助詞-格助詞", "PART": "助詞-終助詞"},
    "助詞-終助詞": {"ADP": {"わ": "助詞-係助詞", "ゎ": "助詞-係助詞", None: "助詞-副助詞"}, "SCONJ": "助詞-準体助詞"},
    #"動詞-一般-サ行変格": {"VERB": "動詞-一般-サ行変格"},
    #"動詞-一般-上一段-ア行": {"VERB": "動詞-一般-上一段-ア行"},
    #"動詞-一般-上一段-カ行": {"VERB": "動詞-一般-上一段-カ行"},
    #"動詞-一般-上一段-ガ行": {"VERB": "動詞-一般-上一段-ガ行"},
    #"動詞-一般-上一段-ザ行": {"VERB": "動詞-一般-上一段-ザ行"},
    #"動詞-一般-上一段-タ行": {"VERB": "動詞-一般-上一段-タ行"},
    #"動詞-一般-上一段-ナ行": {"VERB": "動詞-一般-上一段-ナ行"},
    #"動詞-一般-上一段-バ行": {"VERB": "動詞-一般-上一段-バ行"},
    #"動詞-一般-上一段-マ行": {"VERB": "動詞-一般-上一段-マ行"},
    #"動詞-一般-上一段-ラ行": {"VERB": "動詞-一般-上一段-ラ行"},
    #"動詞-一般-下一段-ア行": {"VERB": "動詞-一般-下一段-ア行"},
    #"動詞-一般-下一段-カ行": {"VERB": "動詞-一般-下一段-カ行"},
    #"動詞-一般-下一段-ガ行": {"VERB": "動詞-一般-下一段-ガ行"},
    #"動詞-一般-下一段-サ行": {"VERB": "動詞-一般-下一段-サ行"},
    #"動詞-一般-下一段-ザ行": {"VERB": "動詞-一般-下一段-ザ行"},
    #"動詞-一般-下一段-タ行": {"VERB": "動詞-一般-下一段-タ行"},
    #"動詞-一般-下一段-ダ行": {"VERB": "動詞-一般-下一段-ダ行"},
    #"動詞-一般-下一段-ナ行": {"VERB": "動詞-一般-下一段-ナ行"},
    #"動詞-一般-下一段-ハ行": {"VERB": "動詞-一般-下一段-ハ行"},
    #"動詞-一般-下一段-バ行": {"VERB": "動詞-一般-下一段-バ行"},
    #"動詞-一般-下一段-マ行": {"VERB": "動詞-一般-下一段-マ行"},
    #"動詞-一般-下一段-ラ行": {"VERB": "動詞-一般-下一段-ラ行"},
    #"動詞-一般-五段-カ行": {"VERB": "動詞-一般-五段-カ行"},
    #"動詞-一般-五段-ガ行": {"VERB": "動詞-一般-五段-ガ行"},
    #"動詞-一般-五段-サ行": {"VERB": "動詞-一般-五段-サ行"},
    #"動詞-一般-五段-タ行": {"VERB": "動詞-一般-五段-タ行"},
    #"動詞-一般-五段-タ行": {"VERB": "動詞-一般-五段-ラ行"},
    #"動詞-一般-五段-ナ行": {"VERB": "動詞-一般-五段-ナ行"},
    #"動詞-一般-五段-バ行": {"VERB": "動詞-一般-五段-バ行"},
    #"動詞-一般-五段-マ行": {"VERB": "動詞-一般-五段-マ行"},
    "動詞-一般-五段-ラ行": {"VERB": {"通う": "動詞-一般-五段-ワア行", "そう": "動詞-一般-五段-ワア行", "つかう": "動詞-一般-五段-ワア行", "ぬう": "動詞-一般-五段-ワア行"}},
    #"動詞-一般-五段-ワア行": {"VERB": "動詞-一般-五段-ワア行"},
    #"動詞-一般-文語カ行変格": {"VERB": "動詞-一般-文語カ行変格"},
    #"動詞-一般-文語サ行変格": {"VERB": "動詞-一般-文語サ行変格"},
    #"動詞-一般-文語ラ行変格": {"VERB": "動詞-一般-文語ラ行変格"},
    #"動詞-一般-文語上二段-ダ行": {"VERB": "動詞-一般-文語上二段-ダ行"},
    #"動詞-一般-文語上二段-ハ行": {"VERB": "動詞-一般-文語上二段-ハ行"},
    #"動詞-一般-文語上二段-バ行": {"VERB": "動詞-一般-文語上二段-バ行"},
    #"動詞-一般-文語下二段-カ行": {"VERB": "動詞-一般-文語下二段-カ行"},
    #"動詞-一般-文語下二段-ガ行": {"VERB": "動詞-一般-文語下二段-ガ行"},
    #"動詞-一般-文語下二段-ナ行": {"VERB": "動詞-一般-文語下二段-ナ行"},
    #"動詞-一般-文語下二段-ハ行": {"VERB": "動詞-一般-文語下二段-ハ行"},
    #"動詞-一般-文語下二段-マ行": {"VERB": "動詞-一般-文語下二段-マ行"},
    #"動詞-一般-文語下二段-ラ行": {"VERB": "動詞-一般-文語下二段-ラ行"},
    #"動詞-一般-文語四段-カ行": {"VERB": "動詞-一般-文語四段-カ行"},
    #"動詞-一般-文語四段-ガ行": {"VERB": "動詞-一般-文語四段-ガ行"},
    #"動詞-一般-文語四段-サ行": {"VERB": "動詞-一般-文語四段-サ行"},
    #"動詞-一般-文語四段-タ行": {"VERB": "動詞-一般-文語四段-タ行"},
    "動詞-一般-文語四段-ハ行": {"VERB": {"いう": "動詞-一般-五段-ワア行", "いふ": "動詞-一般-五段-ワア行", "思ふ": "動詞-一般-五段-ワア行"}},
    #"動詞-一般-文語四段-マ行": {"VERB": "動詞-一般-文語四段-マ行"},
    #"動詞-一般-文語四段-ラ行": {"VERB": "動詞-一般-文語四段-ラ行"},
    "動詞-非自立可能-カ行変格": {"VERB": "動詞-一般-カ行変格"},
    "動詞-非自立可能-サ行変格": {"VERB": "動詞-一般-サ行変格"},
    "動詞-非自立可能-上一段-ア行": {"VERB": "動詞-一般-上一段-ア行"},
    "動詞-非自立可能-上一段-カ行": {"VERB": "動詞-一般-上一段-カ行"},
    "動詞-非自立可能-上一段-ガ行": {"VERB": "動詞-一般-上一段-ガ行"},
    "動詞-非自立可能-上一段-マ行": {"VERB": "動詞-一般-上一段-マ行"},
    "動詞-非自立可能-下一段-ア行": {"VERB": "動詞-一般-下一段-ア行"},
    "動詞-非自立可能-下一段-カ行": {"VERB": "動詞-一般-下一段-カ行"},
    "動詞-非自立可能-下一段-ガ行": {"VERB": "動詞-一般-下一段-ガ行"},
    "動詞-非自立可能-下一段-サ行": {"VERB": "動詞-一般-下一段-サ行"},
    "動詞-非自立可能-下一段-マ行": {"VERB": "動詞-一般-下一段-マ行"},
    "動詞-非自立可能-下一段-ラ行": {"VERB": "動詞-一般-下一段-ラ行"},
    "動詞-非自立可能-五段-カ行": {"VERB": "動詞-一般-五段-カ行"},
    "動詞-非自立可能-五段-サ行": {"VERB": "動詞-一般-五段-サ行"},
    "動詞-非自立可能-五段-ラ行": {"AUX": {"やる": "助動詞-助動詞-ヤ", "なる": "助動詞-文語助動詞-ナリ-断定"}, "VERB": "動詞-一般-五段-ラ行"},  # "VERB": {"ある": "動詞-一般-五段-ワア行"
    "動詞-非自立可能-五段-ワア行": {"VERB": "動詞-一般-五段-ワア行"},
    "動詞-非自立可能-文語サ行変格": {"VERB": "動詞-一般-文語サ行変格"},
    "動詞-非自立可能-文語ラ行変格": {"VERB": "動詞-一般-文語ラ行変格"},
    "動詞-非自立可能-文語上一段-マ行": {"VERB": "動詞-一般-文語上一段-マ行"},
    "動詞-非自立可能-文語下二段-タ行": {"VERB": "動詞-一般-文語下二段-タ行"},
    "動詞-非自立可能-文語下二段-ラ行": {"VERB": "動詞-一般-文語下二段-ラ行"},
    "動詞-非自立可能-文語四段-サ行": {"VERB": "動詞-一般-文語四段-サ行"},
    "動詞-非自立可能-文語四段-ハ行": {"VERB": "動詞-一般-文語四段-ハ行"},
    "動詞-非自立可能-文語四段-ラ行": {"VERB": "動詞-一般-文語四段-ラ行"},
    "名詞-助動詞語幹": {"AUX": "名詞-助動詞語幹"},
    "名詞-固有名詞-一般": {"PROPN": "名詞-固有名詞-一般"},
    "名詞-固有名詞-人名-一般": {"PROPN": "名詞-固有名詞-人名-一般"},
    "名詞-固有名詞-人名-名": {"PROPN": "名詞-固有名詞-人名-名"},
    "名詞-固有名詞-人名-姓": {"PROPN": "名詞-固有名詞-人名-姓"},
    "名詞-固有名詞-地名-一般": {"PROPN": "名詞-固有名詞-地名-一般"},
    "名詞-固有名詞-地名-国": {"PROPN": "名詞-固有名詞-地名-国"},
    #"名詞-数詞": {"NUM": "名詞-数詞"},
    #"名詞-普通名詞-サ変可能": {"NOUN": "名詞-普通名詞-一般"},
    #"名詞-普通名詞-一般": {"NOUN": "名詞-普通名詞-一般"},
    "名詞-普通名詞-副詞可能": {"ADJ": {"近く": "形容詞-一般-形容詞", None: "形状詞-一般"}, "ADP": "助詞-副助詞", "PART": "助詞-副助詞", "VERB": "動詞-一般-五段-ラ行"},
    #"名詞-普通名詞-助数詞可能": {"NOUN": "名詞-普通名詞-一般"},
    #"名詞-普通名詞-形状詞可能": {"ADJ": "形状詞-一般"},
    "形容詞-一般-形容詞": {"ADJ": "形容詞-一般-形容詞"},
    "形容詞-一般-文語形容詞-ク": {"ADJ": "形容詞-一般-文語形容詞-ク"},
    "形容詞-一般-文語形容詞-シク": {"ADJ": "形容詞-一般-文語形容詞-シク"},
    "形容詞-非自立可能-形容詞": {"ADJ": "形容詞-一般-形容詞", "SCONJ": "助動詞-助動詞-ナイ"},
    "形容詞-非自立可能-文語形容詞-ク": {"ADJ": "形容詞-一般-文語形容詞-ク"},
    "形状詞-タリ": {"ADJ": "形状詞-タリ"},
    "形状詞-一般": {"ADJ": "形状詞-一般"},
    "形状詞-助動詞語幹": {"AUX": "形状詞-助動詞語幹", "NOUN": "形状詞-助動詞語幹"},
    "感動詞-フィラー": {"INTJ": "感動詞-フィラー"},
    #"感動詞-一般": {"INTJ": "感動詞-一般"},
    "接尾辞-名詞的-一般": {"ADP": "助詞-副助詞"},  # "NOUN": "接尾辞-名詞的-一般"},
    #"接尾辞-名詞的-副詞可能": None,
    #"接尾辞-名詞的-助数詞": None,
    "接尾辞-形容詞的-形容詞": {"AUX": "助動詞-助動詞-ラシイ", "NOUN": "接尾辞-形容詞的-形容詞", "PART": "接尾辞-形容詞的-形容詞"},
    "接尾辞-形容詞的-文語形容詞-シク": {"AUX": "助動詞-文語助動詞-ラシ"},
    #"接尾辞-形状詞的": None,
    "接続詞": {"ADP": {"て": "助詞-副助詞", None: "助詞-格助詞"}, "AUX": "助動詞-助動詞-ダ"},
    "接頭辞": {"NOUN": "接頭辞"},
    "補助記号-ＡＡ-一般": {"SYM": "補助記号-ＡＡ-一般"},
    "補助記号-ＡＡ-顔文字": {"SYM": "補助記号-ＡＡ-顔文字"},
    "補助記号-一般": {"ADP": "助詞-格助詞"},
    "補助記号-句点": {"PUNCT": "補助記号-句点"},
    "補助記号-括弧閉": {"PUNCT": "補助記号-括弧閉"},
    "補助記号-括弧開": {"PUNCT": "補助記号-括弧開"},
    "補助記号-読点": {"PUNCT": "補助記号-読点"},
    #"記号-一般": {"SYM": "補助記号-一般"},
    "記号-文字": {"NOUN": "記号-文字"},
    "連体詞": {"ADJ": {"あんな": "形状詞-一般", "こんな": "形状詞-一般", "そんな": "形状詞-一般", "どんな": "形状詞-一般", None: "連体詞"}, "INTJ": "感動詞-フィラー", "PRON": "連体詞", "VERB": "動詞-一般-五段-ラ行"},

    # out of LUW corpora
    "動詞-一般-上一段-ハ行": {"VERB": "動詞-一般-上一段-ハ行"},
    "動詞-一般-下一段-ラ行-呉レル": {"VERB": "動詞-一般-下一段-ラ行-呉レル"},
    "動詞-一般-文語四段-バ行": {"VERB": "動詞-一般-文語四段-バ行"},
    "動詞-一般-文語上二段-ア行": {"VERB": "動詞-一般-文語上二段-ア行"},
    "動詞-一般-文語上二段-カ行": {"VERB": "動詞-一般-文語上二段-カ行"},
    "動詞-一般-文語上二段-ガ行": {"VERB": "動詞-一般-文語上二段-ガ行"},
    "動詞-一般-文語上二段-タ行": {"VERB": "動詞-一般-文語上二段-タ行"},
    "動詞-一般-文語上二段-マ行": {"VERB": "動詞-一般-文語上二段-マ行"},
    "動詞-一般-文語上二段-ヤ行": {"VERB": "動詞-一般-文語上二段-ヤ行"},
    "動詞-一般-文語上二段-ラ行": {"VERB": "動詞-一般-文語上二段-ラ行"},
    "動詞-一般-文語下二段-サ行": {"VERB": "動詞-一般-文語下二段-サ行"},
    "動詞-一般-文語下二段-ザ行": {"VERB": "動詞-一般-文語下二段-ザ行"},
    "動詞-一般-文語下二段-バ行": {"VERB": "動詞-一般-文語下二段-バ行"},
    "動詞-一般-文語下二段-ラ行": {"VERB": "動詞-一般-文語下二段-ラ行"},
    "動詞-一般-文語下二段-ワ行": {"VERB": "動詞-一般-文語下二段-ワ行"},
    "動詞-一般-文語ナ行変格": {"VERB": "動詞-一般-文語ナ行変格"},
    "助動詞-助動詞-ドス": {"AUX": "助動詞-助動詞-ドス"},
    "助動詞-文語助動詞-ケム": {"AUX": "助動詞-文語助動詞-ケム"},
    "助動詞-文語助動詞-コス": {"AUX": "助動詞-文語助動詞-コス"},
    "助動詞-文語助動詞-ザマス": {"AUX": "助動詞-文語助動詞-ザマス"},
    "助動詞-文語助動詞-ザンス": {"AUX": "助動詞-文語助動詞-ザンス"},
    "助動詞-文語助動詞-ツ": {"AUX": "助動詞-文語助動詞-ツ"},
    "助動詞-文語助動詞-マシ": {"AUX": "助動詞-文語助動詞-マシ"},
    "助動詞-文語助動詞-ムズ": {"AUX": "助動詞-文語助動詞-ムズ"},
    "助動詞-文語助動詞-メリ": {"AUX": "助動詞-文語助動詞-メリ"},
    "助動詞-文語助動詞-ラム": {"AUX": "助動詞-文語助動詞-ラム"},
    "助動詞-文語助動詞-ンス": {"AUX": "助動詞-文語助動詞-ンス"},
    "助動詞-文語形容詞-シク": {"AUX": "助動詞-文語形容詞-シク"},
}

LAST_SUW_XPOS_TO_LUW_XPOS = {
    "副詞": {"ADJ": {"ごい": "形容詞-一般-形容詞", "たっぷり": "形状詞-一般", "依然": "形状詞-一般", "ど〜": "助詞-副助詞", "より": "助詞-格助詞", None: "形容詞-一般-形容詞"}},
    "助動詞-五段-ワア行": {"VERB": "動詞-一般-五段-ラ行"},
    "助動詞-助動詞-ジャ": {"ADP": "助詞-格助詞", "SCONJ": "助動詞-助動詞-ダ"},
    "助動詞-助動詞-タ": {"ADP": "助詞-格助詞", "SCONJ": "助詞-接続助詞"},
    "助動詞-助動詞-ダ": {"ADP": "助詞-格助詞", "PART": "助詞-終助詞", "SCONJ": "助詞-接続助詞", "VERB": "動詞-一般-下一段-ダ行"},
    "助動詞-助動詞-ドス": {"VERB": "動詞-一般-五段-サ行"},
    "助動詞-助動詞-ナイ": {"ADJ": "形容詞-一般-形容詞", "PART": "助詞-終助詞"},
    "助動詞-助動詞-ヌ": {"ADP": "助詞-副助詞", "AUX": "助動詞-文語助動詞-ヌ", "PART": "助詞-副助詞"},
    "助動詞-助動詞-ヤ": {"ADP": "助詞-副助詞", "VERB": "動詞-一般-五段-ラ行"},
    "助動詞-助動詞-ラシイ": {"ADJ": "形容詞-一般-形容詞"},
    "助動詞-文語下二段-ラ行": {"VERB": "動詞-一般-カ行変格"},
    "助動詞-文語助動詞-タリ-断定": {"ADJ": "連体詞", "VERB": "動詞-一般-五段-ラ行"},
    "助動詞-文語助動詞-ム": {"SCONJ": "助動詞-助動詞-ヌ"},
    "助動詞-文語助動詞-リ": {"ADP": "助詞-格助詞"},
    "助詞-係助詞": {"SCONJ": "助詞-接続助詞"},
    "助詞-副助詞": {"ADP": {"か": "助詞-副助詞", "て": "助詞-副助詞", "まで": "助詞-格助詞", None: "助詞-副助詞"}, "SCONJ": "助詞-接続助詞"},
    "動詞-一般-サ行変格": {"ADP": "助詞-格助詞"},
    "動詞-一般-下一段-ラ行": {"SCONJ": "助詞-接続助詞"},
    "動詞-一般-五段-カ行": {"ADP": "助詞-格助詞"},
    "動詞-一般-五段-ラ行": {"ADP": "助詞-格助詞"},
    "動詞-一般-五段-ワア行": {"ADP": "助詞-格助詞"},
    "動詞-一般-文語四段-ハ行": {"ADP": "助詞-格助詞"},
    "動詞-一般-文語四段-ハ行": {"SCONJ": "助詞-接続助詞"},
    "動詞-非自立可能-カ行変格": {"SCONJ": "助動詞-カ行変格"},
    "動詞-非自立可能-サ行変格": {"SCONJ": "助詞-接続助詞"},
    "動詞-非自立可能-上一段-ア行": {"SCONJ": "助動詞-上一段-ア行"},
    "動詞-非自立可能-上一段-マ行": {"SCONJ": "助動詞-上一段-マ行"},
    "動詞-非自立可能-下一段-ア行": {"SCONJ": "助動詞-下一段-ア行"},
    "動詞-非自立可能-下一段-カ行": {"SCONJ": "助動詞-下一段-カ行"},
    "動詞-非自立可能-下一段-マ行": {"ADP": "助詞-格助詞"},
    "動詞-非自立可能-下一段-ラ行": {"SCONJ": "助動詞-下一段-ラ行"},
    "動詞-非自立可能-五段-カ行": {"ADP": "助詞-格助詞"},
    "動詞-非自立可能-五段-カ行": {"SCONJ": "助動詞-五段-カ行"},
    "動詞-非自立可能-五段-ラ行": {"ADP": "助詞-格助詞"},
    "動詞-非自立可能-五段-ラ行": {"SCONJ": "助動詞-五段-ラ行", "VERB": {"ある": "助動詞-五段-ラ行", "有る": "助動詞-五段-ラ行", "なる": "助動詞-五段-ラ行", None: "動詞-一般-五段-ラ行"}},
    "動詞-非自立可能-五段-ワア行": {"SCONJ": "助動詞-五段-ワア行"},
    "動詞-非自立可能-文語ラ行変格": {"SCONJ": "助動詞-五段-ラ行"},
    "名詞-普通名詞-サ変可能": {"PART": "助詞-終助詞"},
    "名詞-普通名詞-一般": {"ADP": "助詞-格助詞", "PART": "助詞-終助詞"},
    "名詞-普通名詞-副詞可能": {"SCONJ": "助詞-接続助詞"},  # "ADP": "助詞-格助詞", 
    "形容詞-一般-形容詞": {"ADJ": "形容詞-一般-形容詞", "VERB": "動詞-一般-五段-ラ行"},
    "形容詞-非自立可能-形容詞": {"ADJ": "形容詞-一般-形容詞", "ADP": "助詞-副助詞", "PART": "助詞-副助詞"},  # , "SCONJ": "助動詞-形容詞"
    "形容詞-非自立可能-文語形容詞-ク": {"ADJ": "形容詞-一般-文語形容詞-ク", "SCONJ": "助動詞-文語形容詞-ク"},
    "形状詞-一般": {"ADJ": "形状詞-一般", "PRON": "連体詞"},
    "感動詞-一般": {"INTJ": "感動詞-一般", "PART": "助詞-終助詞", "VERB": "動詞-一般-五段-ラ行"},
    "接尾辞-動詞的-上一段-マ行": {"VERB": "動詞-一般-上一段-マ行"},
    "接尾辞-動詞的-下一段-ナ行": {"VERB": "動詞-一般-下一段-ナ行"},
    "接尾辞-動詞的-五段-カ行": {"VERB": "動詞-一般-五段-カ行"},
    "接尾辞-動詞的-五段-サ行": {"VERB": "動詞-一般-五段-サ行"},
    "接尾辞-動詞的-五段-マ行": {"VERB": "動詞-一般-五段-マ行"},
    "接尾辞-動詞的-五段-ラ行": {"VERB": "動詞-一般-五段-ラ行"},
    #"接頭辞": {"NOUN": "名詞-普通名詞-一般"},
    "補助記号-一般": {"PUNCT": "補助記号-句点"},
    "補助記号-句点": {"NOUN": "補助記号-句点", "PUNCT": "補助記号-句点", "SYM": "補助記号-一般"},
    "補助記号-読点": {"NOUN": "補助記号-読点", "PUNCT": "補助記号-読点"},
    "記号-一般": {"PART": "助詞-終助詞"},
}

for suw_xpos, v in LAST_SUW_XPOS_TO_LUW_XPOS.items():
    if suw_xpos not in SUW_XPOS_TO_LUW_XPOS:
        SUW_XPOS_TO_LUW_XPOS[suw_xpos] = v
        continue
    upos_cond = SUW_XPOS_TO_LUW_XPOS[suw_xpos]
    if isinstance(v, str):
        assert upos_cond == v, (suw_xpos, v, upos_cond)
        continue
    for upos, v2 in v.items():
        if upos not in upos_cond:
            upos_cond[upos] = v2
            continue
        lemma_cond = upos_cond[upos]
        if isinstance(v2, str):
            assert lemma_cond == v2, (suw_xpos, v, upos_cond, v2, lemma_cond)
            continue
        if isinstance(lemma_cond, str):
            if None in v2:
                assert lemma_cond == v2[None], (suw_xpos, v, upos_cond, v2, lemma_cond)
            else:
                v2[None] = lemma_cond
            upos_cond[upos] = v2
            continue
        for lemma, v3 in v2.items():
            if lemma not in lemma_cond:
                lemma_cond[lemma] = v3
            else:
                assert lemma_cond[lemma] == v3, (suw_xpos, v, upos_cond, v2, lemma_cond, lemma, v3)
